Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: There are many [built-in matchers](reference/matchers.md) for common types (as well as [custom matchers](gmock_cook_book.md#NewMatchers)); for example:
it_it: Esistono molti [matcher nativi [built-in]](reference/matchers.md) per i tipi comuni (così come [matcher personalizzati](gmock_cook_book.md#NewMatchers)); per esempio:

source: There are many good reasons for you to use this framework.
it_it: Ci sono molte buone ragioni per utilizzare questo framework.

source: There are many ways to express dependencies in the CMake ecosystem; in this quickstart, you'll use the FetchContent CMake module.
it_it: Esistono molti modi per esprimere le dipendenze nell'ecosistema CMake; in questa guida rapida si userà il modulo FetchContent di CMake.

source: There are many ways to express dependencies in the CMake ecosystem; in this quickstart, you'll use the [`FetchContent` CMake module](https://cmake.org/cmake/help/latest/module/FetchContent.html).
it_it: Esistono molti modi per esprimere le dipendenze nell'ecosistema CMake; in questa guida rapida si userà `FetchContent` di CMake](https://cmake.org/cmake/help/latest/module/FetchContent.html).

source: There are several good reasons:
it_it: Ci sono diversi buoni motivi:

source: There are some caveats though (sadly they are side effects of C++'s limitations):
it_it: Ci sono però alcuni avvertimenti (purtroppo sono effetti collaterali delle limitazioni del C++):

source: There are some restrictions:
it_it: Ci sono alcune restrizioni:

source: There are two better ways to write the test spec.
it_it: Esistono due modi migliori per scrivere le specifiche del test.

source: There are two kinds of assertions—those with names beginning with ASSERT_ and those beginning with EXPECT_.
it_it: Esistono due tipi di asserzioni: quelle i cui nomi iniziano con ASSERT_ e quelle che iniziano con EXPECT_.

source: There are two solutions to this problem.
it_it: Ci sono due soluzioni a questo problema.

source: There is more abstraction for the programmers to learn.
it_it: C'è più astrazione da imparare per i programmatori.

source: There is no corresponding environment variable for this flag.
it_it: Non esiste una variabile di ambiente corrispondente per questo flag.

source: There is no need to print the argument value itself, as gMock already prints it for you.
it_it: Non è necessario stampare il valore dell'argomento stesso, poiché gMock lo stampa già.

source: There may be more than one iteration if GTEST_FLAG(repeat) is set.
it_it: Potrebbero esserci più iterazioni se è impostato GTEST_FLAG(repeat).

source: There may be more than one iteration if `GTEST_FLAG(repeat)` is set.
it_it: Potrebbero esserci più iterazioni se è impostato `GTEST_FLAG(repeat)`.

source: There's a higher probability of detecting the fail if the test is run a couple times.
it_it: C'è una maggiore probabilità di rilevare il fallimento se il test viene eseguito un paio di volte.

source: There's only one problem: the default test result printer is still in effect, so its output will mingle with the output from your minimalist printer.
it_it: C'è solo un problema: la stampante di default dei risultati del test è ancora attiva, quindi il suo output si confonderà con quello della propria stampante minimalista.

source: Therefore usually you'll want the parameter values to be part of the description.
it_it: Pertanto di solito i valori dei parametri faranno parte della descrizione.

source: Therefore **do not delete them** by yourself.
it_it: Pertanto **non vanno eliminati** manualmente.

source: Therefore do not delete them by yourself.
it_it: Pertanto non vanno eliminati manualmente.

source: Therefore copying actions is also allowed and very efficient.
it_it: Pertanto anche le azioni di copia sono consentite e molto efficienti.

source: Therefore it needs to be prefixed with ::testing::Test:: if used outside of the TEST body and the test fixture class.
it_it: Pertanto deve avere il prefisso ::testing::Test:: se utilizzato al di fuori del corpo di TEST e della classe della fixture.

source: Therefore it needs to be prefixed with `::testing::Test::` if used outside of the `TEST` body and the test fixture class.
it_it: Pertanto deve avere il prefisso `::testing::Test::` se utilizzato al di fuori del corpo di `TEST` e della classe della fixture.

source: Therefore it's a good idea to turn on the heap checker in your tests when you allocate mocks on the heap.
it_it: Pertanto è una buona idea attivare il controllo dell'heap nei test quando si allocano i mock sull'heap.

source: Therefore it's best to follow the rule.
it_it: Quindi è meglio seguire la regola.

source: Therefore make sure your program can run side-by-side with itself and is deterministic.
it_it: Il programma deve poter funzionare fianco a fianco con se stesso e che sia deterministico.

source: Therefore this statement
it_it: Pertanto questa istruzione

source: Therefore we encourage you to specify only what's necessary—no more, no less.
it_it: Pertanto invitiamo a specificare solo ciò che è necessario, né più né meno.

source: Therefore we implemented it.
it_it: Pertanto lo abbiamo implementato.

source: Therefore we only do it where it's most needed (otherwise we make the implementation of GoogleTest harder to maintain and more error-prone than necessary).
it_it: Pertanto lo facciamo solo dove è più necessario (altrimenti rendiamo l'implementazione di GoogleTest più difficile da mantenere e più soggetta a errori del necessario).

source: Therefore we recommend to avoid them in C++ as much as possible.
it_it: Pertanto consigliamo di evitarli il più possibile in C++.

source: Therefore we strongly advise against the practice, and GoogleTest doesn't provide a way to do it.
it_it: Pertanto sconsigliamo vivamente questa pratica e GoogleTest non fornisce un modo per farlo.

source: Therefore we want to invest more in the matchers than in the EXPECT_XX() macros.
it_it: Pertanto vogliamo investire di più nei matcher che nelle macro EXPECT_XX().

source: Therefore we want to invest more in the matchers than in the `EXPECT_XX()` macros.
it_it: Pertanto vogliamo investire di più nei matcher che nelle macro `EXPECT_XX()`.

source: Therefore you must be careful about side effects.
it_it: Pertanto è necessario fare attenzione agli effetti collaterali.

source: Therefore you should prefer TearDown() if you want to write portable tests that work with or without exceptions.
it_it: Pertanto è preferibile TearDown() se si vogliono scrivere test portabili che funzionino con o senza eccezioni.

source: Therefore you should prefer `TearDown()` if you want to write portable tests that work with or without exceptions.
it_it: Pertanto è preferibile `TearDown()` se si vogliono scrivere test portabili che funzionino con o senza eccezioni.

source: Therefore you'll get a different order every time.
it_it: Pertanto si riceverà ogni volta un ordine diverso.

source: Therefore, GoogleTest only prints them when the death test has failed.
it_it: Pertanto GoogleTest li stampa solo quando il death test è fallito.

source: Therefore, you may want to move your EXPECT_CALL statements inside the EXPECT_DEATH macro.
it_it: Pertanto, si potrebbero spostare le istruzioni EXPECT_CALL nella macro EXPECT_DEATH.

source: Therefore, **don't abuse this**.
it_it: Pertanto, **non abusarne**.

source: Therefore, **per the black-box testing principle, most of the time you should test your code through its public interfaces.**
it_it: Pertanto, **secondo il principio del test della black-box, la maggior parte delle volte si deve testare il codice tramite le sue interfacce pubbliche**.

source: Therefore, don't abuse this.
it_it: Pertanto, non abusare.

source: Therefore, per the black-box testing principle, most of the time you should test your code through its public interfaces.
it_it: Pertanto, secondo il principio del test della black-box, la maggior parte delle volte si deve testare il codice tramite le sue interfacce pubbliche.

source: Therefore, all matchers must be *purely functional*: they cannot have any side effects, and the match result must not depend on anything other than the matcher's parameters and the value being matched.
it_it: Pertanto, tutti i matcher devono essere *puramente funzionali*: non possono avere effetti collaterali e il risultato della corrispondenza non deve dipendere da nient'altro che dai parametri del matcher e dal valore da abbinare.

source: Therefore, all matchers must be purely functional: they cannot have any side effects, and the match result must not depend on anything other than the matcher's parameters and the value being matched.
it_it: Pertanto, tutti i matcher devono essere puramente funzionali: non possono avere effetti collaterali e il risultato della corrispondenza non deve dipendere da nient'altro che dai parametri del matcher e dal valore da abbinare.

source: Therefore, all matchers must be functionally pure.
it_it: Pertanto, tutti i matcher devono essere funzionalmente puri.

source: Therefore, each of them will have its own domain-specific interface on top of Concrete, and they will not be the same code.
it_it: Pertanto, ognuno di essi avrà la propria interfaccia specifica del dominio al di sopra di Concrete, e non avranno lo stesso codice.

source: Therefore, each of them will have its own domain-specific interface on top of `Concrete`, and they will not be the same code.
it_it: Pertanto, ognuno di essi avrà la propria interfaccia specifica del dominio al di sopra di `Concrete`, e non avranno lo stesso codice.

source: Therefore, if the set-up operation could cause a fatal test failure that should prevent the test from running, it's necessary to use abort and abort the whole test executable, or to use SetUp() instead of a constructor.
it_it: Pertanto, se l'operazione di configurazione potrebbe causare un fallimento fatale del test che dovrebbe impedire l'esecuzione del test, è necessario utilizzare abort e abortire l'intero eseguibile del test, oppure utilizzare SetUp() invece di un costruttore.

source: Therefore, if the set-up operation could cause a fatal test failure that should prevent the test from running, it's necessary to use `abort` and abort the whole test executable, or to use `SetUp()` instead of a constructor.
it_it: Pertanto, se l'operazione di configurazione potrebbe causare un fallimento fatale del test che dovrebbe impedire l'esecuzione del test, è necessario utilizzare `abort` e abortire l'intero eseguibile del test, oppure utilizzare `SetUp()` invece di un costruttore.

source: Therefore, if you have some complex matcher that you want to use again and again, there is no need to build it every time.
it_it: Pertanto, se si ha un matcher complesso che si vuole utilizzare più e più volte, non è necessario crearlo ogni volta.

source: Therefore, if you need to call a method that will be overridden in a derived class, you have to use SetUp()/TearDown().
it_it: Pertanto, dovendo chiamare un metodo che verrà sovrascritto in una classe derivata, si deve usare SetUp()/TearDown().

source: Therefore, if you need to call a method that will be overridden in a derived class, you have to use `SetUp()/TearDown()`.
it_it: Pertanto, dovendo chiamare un metodo che verrà sovrascritto in una classe derivata, si deve usare `SetUp()/TearDown()`.

source: Therefore, it's a good idea to use assertion macros in the TearDown code for better maintenance.
it_it: Pertanto, è una buona idea utilizzare le macro di asserzione nel codice TearDown per una migliore manutenzione.

source: Therefore, sometimes a user has to use EXPECT_TRUE() to check a complex expression, for lack of a better macro.
it_it: Pertanto, a volte un utente deve utilizzare EXPECT_TRUE() per verificare un'espressione complessa, in mancanza di una macro migliore.

source: Therefore, sometimes a user has to use `EXPECT_TRUE()` to check a complex expression, for lack of a better macro.
it_it: Pertanto, a volte un utente deve utilizzare `EXPECT_TRUE()` per verificare un'espressione complessa, in mancanza di una macro migliore.

source: Therefore, the Foo base class above is equivalent to:
it_it: Pertanto, la classe base Foo sopra è equivalente a:

source: Therefore, the `Foo` base class above is equivalent to:
it_it: Pertanto, la classe base `Foo` sopra è equivalente a:

source: Therefore, to mock such a function, the *user* must teach the mock object how to figure out the number of arguments and their types.
it_it: Pertanto, per simulare una funzione del genere, l'*utente* deve insegnare all'oggetto mock-ato come calcolare il numero di argomenti e i loro tipi.

source: Therefore, to mock such a function, the user must teach the mock object how to figure out the number of arguments and their types.
it_it: Pertanto, per simulare una funzione del genere, l'utente deve insegnare all'oggetto mock-ato come calcolare il numero di argomenti e i loro tipi.

source: Therefore, you may want to move your `EXPECT_CALL` statements inside the `EXPECT_DEATH` macro.
it_it: Pertanto, si potrebbero spostare le istruzioni `EXPECT_CALL` nella macro `EXPECT_DEATH`.

source: Therefore, you shouldn't use GoogleTest assertions in a destructor if your code could run on such a platform.
it_it: Pertanto, non si dovrebbero usare le asserzioni GoogleTest in un distruttore se il codice può essere eseguito su tali piattaforme.

source: These are ordinary C++ functions that don't return a value.
it_it: Queste sono normali funzioni C++ che non restituiscono un valore.

source: These are useful when control flow, rather than a Boolean expression, determines the test's success or failure, as shown by the following example:
it_it: Questi sono utili quando il flusso di controllo, piuttosto che un'espressione booleana, determina il successo o il fallimento del test, come mostrato nell'esempio seguente:

source: These assertions also accept wide C strings (wchar_t*).
it_it: Queste asserzioni accettano anche stringhe C "wide" (wchar_t*).

source: These assertions also accept wide C strings (`wchar_t*`).
it_it: Queste asserzioni accettano anche stringhe C "wide" (`wchar_t*`).

source: These assertions spawn a new process and execute the code under test in that process.
it_it: Queste asserzioni generano [spawn] un nuovo processo ed eseguono il codice in prova in quel processo.

source: These assertions work on user-defined types too, but you must overload the corresponding comparison operator (==, !=, <=, and so on).
it_it: Queste asserzioni funzionano anche sui tipi definiti dall'utente, ma è necessario l'overload dell'operatore di confronto corrispondente (==, !=, <=, e così via).

source: These assertions work with both narrow and wide string objects (string and wstring).
it_it: Queste asserzioni funzionano sia con oggetti stringa "narrow" che "wide" (string e wstring).

source: These assertions work with both narrow and wide string objects (`string` and `wstring`).
it_it: Queste asserzioni funzionano sia con oggetti stringa "narrow" che "wide" (`string` e `wstring`).

source: These consistency checks, which ensure that the program is in a known good state, are there to fail at the earliest possible time after some program state is corrupted.
it_it: Questi controlli di coerenza, per verificare che il programma sia in uno stato sicuramente buono, sono destinati a fallire il prima possibile dopo che uno stato del programma viene corrotto.

source: These failures are common if you installed GoogleTest yourself and have not sourced it from a distro or other package manager.
it_it: Questi errori sono comuni se GoogleTest è stato installato da solo e non lo fa parte di una distribuzione o di un altro gestore di pacchetti.

source: These macros are still supported, though migration to the new MOCK_METHOD is recommended.
it_it: Queste macro sono ancora supportate, sebbene sia consigliata la migrazione al nuovo MOCK_METHOD.

source: These macros are still supported, though migration to the new `MOCK_METHOD` is recommended.
it_it: Queste macro sono ancora supportate, sebbene sia consigliata la migrazione al nuovo `MOCK_METHOD`.

source: These matchers can also match:
it_it: Questi matcher possono anche corrispondere a:

source: They use the regular expression syntax defined here.
it_it: Usano la sintassi delle espressioni regolari definita qui.

source: They also allow overloading matchers based on parameter types (as opposed to just based on the number of parameters).
it_it: Consentono inoltre l'overloading di matcher in base ai tipi di parametri (invece che basarsi solo sul numero di parametri).

source: They also don't allow overloading actions based on parameter types without jumping through some hoops.
it_it: Inoltre, non consentono overload di azioni basate sui tipi di parametri senza eseguire alcuni passaggi.

source: They are unsafe to use and don't work with arguments that have constructors or destructors.
it_it: Non sono sicuri da usare e non funzionano con argomenti che hanno costruttori o distruttori.

source: They are described in the following two subsections.
it_it: Sono tutte descritte nelle due sottosezioni seguenti.

source: They are however *not* redundant, as they refer to *different points in time*.
it_it: Tuttavia *non* sono ridondanti, poiché si riferiscono a *diversi momenti nel tempo*.

source: They are however not redundant, as they refer to different points in time.
it_it: Tuttavia non sono ridondanti, poiché si riferiscono a diversi momenti nel tempo.

source: They automatically pick a reasonable error bound based on the absolute value of the expected value.
it_it: Scelgono automaticamente un limite di errore ragionevole in base al valore assoluto del valore atteso.

source: They use the regular expression syntax defined [here](../advanced.md#regular-expression-syntax).
it_it: Usano la sintassi delle espressioni regolari definita [qui](../advanced.md#regular-expression-syntax).

source: Things to note:
it_it: Cose da notare:

source: Think of this as *declaring* your abstract tests.
it_it: Lo si consideri come una *dichiarazione* dei test astratti.

source: Think of this as *implementing* your abstract tests.
it_it: Lo si consideri come *implementazione* dei test astratti.

source: Think of this as declaring your abstract tests.
it_it: Lo si consideri come una dichiarazione dei test astratti.

source: Think of this as implementing your abstract tests.
it_it: Lo si consideri come implementazione dei test astratti.

source: This section in the user's guide explains it.
it_it: Questa sezione nella guida utente lo spiega.

source: This allows you to write your code (user of the interface) in a more natural way, which means it will be more readable, more maintainable, and you'll be more productive.
it_it: Ciò consente di scrivere il codice (l'utilizzatore dell'interfaccia) in un modo più naturale, il che significa che sarà più leggibile, più gestibile e si sarà più produttivi.

source: This can be useful when creating combined matchers.
it_it: Questo può essere utile quando si creano matcher combinati.

source: This ensures that failures generated by the latter are attributed to the right test by the former.
it_it: Ciò garantisce che i fallimenti generati da questi ultimi vengano attribuiti al test corretto da parte dei primi.

source: This is especially useful when running under a debugger: when the test fails, it will drop into the debugger and you can then inspect variables and stacks.
it_it: Ciò è particolarmente utile quando si esegue in un debugger: quando il test fallisce, verrà inserito nel debugger e si potrà poi ispezionare variabili e stack.

source: This *does not* make the overall test succeed.
it_it: Ciò *non* fa sì che il test complessivo abbia successo.

source: This cc_test rule declares the C++ test binary you want to build, and links to GoogleTest (//:gtest_main) using the prefix you specified in the WORKSPACE file (@com_google_googletest).
it_it: Questa regola cc_test dichiara il file binario di test C++ che si vuole buildare e lo collega [link] a GoogleTest (//:gtest_main) utilizzando il prefisso specificato nel file WORKSPACE (@com_google_googletest).

source: This does not make the overall test succeed.
it_it: Ciò non fa sì che il test complessivo abbia successo.

source: This Google Testing Blog post says it excellently.
it_it: Questo post del Google Testing Blog lo dice in modo eccellente.

source: This Google Testing Blog [post](https://testing.googleblog.com/2008/06/defeat-static-cling.html) says it excellently.
it_it: Questo [post](https://testing.googleblog.com/2008/06/defeat-static-cling.html) del Google Testing Blog lo dice in modo eccellente.

source: This [section](advanced.md#assertion-placement) in the user's guide explains it.
it_it: Questa [sezione](advanced.md#assertion-placement) nella guida utente lo spiega.

source: This `cc_test` rule declares the C++ test binary you want to build, and links to GoogleTest (`//:gtest_main`) using the prefix you specified in the `WORKSPACE` file (`@com_google_googletest`).
it_it: Questa regola `cc_test` dichiara il file binario di test C++ che si vuole buildare e lo collega [link] a GoogleTest (`//:gtest_main`) utilizzando il prefisso specificato nel file `WORKSPACE` (`@com_google_googletest`).

source: This allows functions to catch fatal failures in a sub-routine and return early.
it_it: Ciò consente alle funzioni di rilevare errori fatali in una subroutine e di tornare anticipatamente.

source: This allows ON_CALL and EXPECT_CALL to reference the mock function from outside of the mock class.
it_it: Ciò consente a ON_CALL e a EXPECT_CALL di fare riferimento alla funzione mock dall'esterno della classe mock.

source: This allows `ON_CALL` and `EXPECT_CALL` to reference the mock function from outside of the mock class.
it_it: Ciò consente a `ON_CALL` e a `EXPECT_CALL` di fare riferimento alla funzione mock dall'esterno della classe mock.

source: This allows a user to express the intent of a test exactly.
it_it: Ciò consente all'utente di esprimere esattamente l'intento di un test.

source: This allows more convenient expression of multiple expectations in a single sequence:
it_it: Ciò consente un'espressione più conveniente di molteplici expectation in un'unica sequenza:

source: This allows output by listeners added later to be framed by output from listeners added earlier.
it_it: Ciò consente all'output dei listener aggiunti successivamente di essere inquadrati [framed] dall'output dei listener aggiunti in precedenza.

source: This allows tests that don't care which overload was invoked to avoid specifying argument matchers:
it_it: Ciò consente di avere test a cui non interessa quale overload sia stato invocato per evitare di specificare i matcher degli argomenti:

source: This allows the matcher to be polymorphic.
it_it: Ciò consente al matcher di essere polimorfico.

source: This allows the user to control a test program's behavior via various flags, which we'll cover in the AdvancedGuide.
it_it: Ciò consente all'utente di controllare il comportamento di un programma di test tramite vari flag, di cui parleremo nella AdvancedGuide.

source: This allows the user to control a test program's behavior via various flags, which we'll cover in the [AdvancedGuide](advanced.md).
it_it: Ciò consente all'utente di controllare il comportamento di un programma di test tramite vari flag, di cui parleremo nella [AdvancedGuide](advanced.md).

source: This allows you to customize how the value appears in GoogleTest's output without affecting code that relies on the behavior of AbslStringify().
it_it: Ciò consente di personalizzare il modo in cui il valore appare nell'output di GoogleTest senza influenzare il codice che si basa sul comportamento di AbslStringify().
